glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F1x0_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>http://gd32mcu.21ic.com/data/documents/yingyongruanjian/</url>
  <name>GD32F1x0_DFP</name>
  <description>GigaDevice GD32F1x0 Series Device Support and Examples</description>
  <releases>
    <release version="3.1.1" date="2018-11-11">
        update firmware.
    </release>
    <release version="3.1.0" date="2018-01-23">
        update firmware.
    </release>
    <release version="3.0.2" date="2017-04-01">
        simplify pack size.
    </release>
    <release version="3.0.1" date="2016-11-18">
        update pdsc file shortage.
    </release>
   <release version="3.0.0" date="2016-07-08">
        update firmware and documents.
    </release>
    <release version="2.0.1" date="2016-04-08">
        adjust pack material.
    </release>
    <release version="2.0.0" date="2016-03-01">
      Updated version of GD32F1x0 Device Family Pack.
      Added new devices: GD32F170T4 GD32F170T6 GD32F170T8 GD32F170C4 GD32F170C6 GD32F170C8 GD32F170R8 
                                      GD32F190T4 GD32F190T6 GD32F190T8 GD32F190C4 GD32F190C6 GD32F190C8 GD32F190R4 GD32F190R6 GD32F190R8
    </release>
    <release version="1.0.1">
    Updated device support files.
    Added SVD file.
    Added datasheets, manual.
    Renamed device names.
  </release>
  <release version="1.0.0">
    First Release version of GD32F1 Device Family Pack.
  </release>
  </releases>
  <keywords>
  <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32F1x0</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32F1x0 Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
GD32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M3 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>

      <feature type="XTAL"               n="4000000"  m="32000000"      name="Crystal Oscillator"/>
      <feature type="CoreOther"       n="1"                                        name="CRC Calculation Unit"/>
      <feature type="DMA"               n="7"                                         name="General Purpose DMA with Centralized FIFO and Burst Support"/>
      <feature type="IntRC"              n="8000000"                              name="Internal high-speed RC Oscillator"/>
      <feature type="IntRC"              n="8000000"                              name="Internal Factory-Trimmed RC"/>      
      <feature type="IntRC"              n="40000"                                  name="Internal RC with Calibration"/>     
      <feature type="RTC"                n="40000"                                  name="RTC with 40 kHz calibrated Oscillator and Battery Backup"/>
      <feature type="PLL"                 n="3"                                         name="Internal PLL"/>
      <feature type="PowerMode"     n="4"                                          name="Run, Sleep, Deep-Sleep, Standby"/>
      <feature type="PowerOther"     n="1"                                         name="POR, PDR, PVD, and BOR"/>
      <feature type="ExtInt"             n="16"                                        name="External interrupt"/>            
      <feature type="Temp"             n="-40"           m="85"                 name="Extended Operating Temperature Range"/>
      <feature type="ADC"               n="1"              m="12"                name="High-Performance ADC"/>
      <feature type="TempSens"      n="1"                                          name="Temperature sensor"/>
      <feature type="Timer"             n="1"              m="32"                 name="32-bit General Purpose Timer"/>
      <feature type="Timer"             n="5"              m="16"                 name="16-bit General Purpose Timer"/>
      <feature type="Timer"             n="1"              m="16"                 name="Advanced Timer"/>
      <feature type="Timer"             n="1"              m="24"                 name="SysTick Timer"/>
      <feature type="WDT"               n="2"                                         name="Watchdog timer"/>
      <feature type="MPSerial"         n="3"                                          name="Multi-Purpose Serial Interface Module: I2C, SPI, USART"/> 
      <feature type="USART"            n="2"              m="9000000"       name="High-Speed USART Interface"/>
  
      <!-- ************************  Subfamily 'GD32F130'  **************************** -->
      <subFamily DsubFamily="GD32F130">
        <processor Dclock="72000000"/>
         <compile header="Device/Include/gd32f1x0.h" define="GD32F130_150"/>
        <debug svd="SVD/GD32F1x0.svd"/>
        <description>
        GD32F130 - ARM Cortex-M3 Core
          Frequency up to 72 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 16KB to 64 KB
          SRAM size from 4KB to 8 KB with HW parity checking
          3KB ISP loader ROM
        </description>
         <feature type="IOs"                   n="55"                                       name="IO pins"/>
         <feature type="I2C"                   n="2"                                        name="Low-Power I2C"/>
         <feature type="SPI"                    n="2"                                        name="SPI Interface"/>
         <feature type="VCC"                  n="2.6"                m="3.6"         name="Voltage"/>
         <feature type="NVIC"                 n="52"                                      name="NVIC"/>
         <feature type="Consumption"      m="0.000059"                          name="Ultra-Low Power Consumption"/>

        <!-- *************************  Device 'GD32F130C4'  ***************************** -->
        <device Dname="GD32F130C4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

