glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F1x0_DFP.pdsc
        <!-- *************************  Device 'GD32F130C6'  ***************************** -->
        <device Dname="GD32F130C6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130C8'  ***************************** -->
        <device Dname="GD32F130C8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130F4'  ***************************** -->
        <device Dname="GD32F130F4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>
 
         <!-- *************************  Device 'GD32F130F6'  ***************************** -->
        <device Dname="GD32F130F6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130F8'  ***************************** -->
        <device Dname="GD32F130F8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130G4'  ***************************** -->
        <device Dname="GD32F130G4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130G6'  ***************************** -->
        <device Dname="GD32F130G6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130G8'  ***************************** -->
        <device Dname="GD32F130G8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>


        <!-- *************************  Device 'GD32F130K4'  ***************************** -->
        <device Dname="GD32F130K4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130K6'  ***************************** -->
        <device Dname="GD32F130K6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130K8'  ***************************** -->
        <device Dname="GD32F130K8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130R8'  ***************************** -->
        <device Dname="GD32F130R8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'GD32F150'  **************************** -->
      <subFamily DsubFamily="GD32F150">
        <processor Dclock="72000000"/>
        <compile header="Device/Include/gd32f1x0.h" define="GD32F130_150"/>
        <debug svd="SVD/GD32F1x0.svd"/>
        <description>
        GD32F150 - ARM Cortex-M3 Core
           Frequency up to 72 MHz
           Flash access zero wait state
           Single-cycle multiplier and hardware divider

        Memories
           Flash size from 16KB to 64 KB
           SRAM size from 4KB to 8 KB with HW parity checking
           3KB ISP loader ROM
        </description>
          <feature type="IOs"                  n="55"                                     name="IO pins"/>
          <feature type="Timer"               n="1"           m="16"                 name="Basic Timer"/>
          <feature type="I2S"                  n="1"                                       name="I2S"/>
          <feature type="USBD"              n="1"                                        name="Full-Speed USB Device"/>
          <feature type="Touch"              n="18"                                      name="Capacitive Touch Inputs"/>
          <feature type="DAC"                n="1"           m="10"                  name="DAC"/>
          <feature type="I2C"                 n="2"                                        name="Low-Power I2C"/>
          <feature type="SPI"                 n="2"                                        name="SPI Interface"/>
          <feature type="Other"              n="2"                                        name="My other Interface"/>
          <feature type="VCC"                n="2.6"        m="3.6"                 name="Voltage"/>
          <feature type="NVIC"               n="52"                                      name="NVIC"/>
          <feature type="Consumption"                       m="0.000107"        name="Ultra-Low Power Consumption"/>
 

        <!-- *************************  Device 'GD32F150C4'  ***************************** -->
        <device Dname="GD32F150C4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

