glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F1x0_DFP.pdsc
        <!-- *************************  Device 'GD32F190C6'  ***************************** -->
        <device Dname="GD32F190C6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190C8'  ***************************** -->
        <device Dname="GD32F190C8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

       <!-- *************************  Device 'GD32F190R4'  ***************************** -->
        <device Dname="GD32F190R4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190R6'  ***************************** -->
        <device Dname="GD32F190R6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190R8'  ***************************** -->
        <device Dname="GD32F190R8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190T4'  ***************************** -->
        <device Dname="GD32F190T4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190T6'  ***************************** -->
        <device Dname="GD32F190T6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190T8'  ***************************** -->
        <device Dname="GD32F190T8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
     </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F1x0">
      <description>GigaDevice GD32F1x0 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F1[3579]0*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="GD32F1x0 CMSIS">
      <description>GigaDevice GD32F1x0 Devices and CMSIS-CORE</description>
      <require condition="GD32F1x0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32F1x0_libopt"/>    
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="RCU"/>           
    </condition>

    <!-- GD32F1x0 STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F1x0 STDPERIPHERALS RCU">
      <description>GigaDevice  GD32F1x0 Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F1x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32F1x0 STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F1x0 STDPERIPHERALS MISC">
      <description>GigaDevice  GD32F1x0 Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F1x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32F1x0 STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F1x0 STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32F1x0 Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F1x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="USART"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="SYSCFG"/>
    </condition>
  </conditions>

  <components>
    <!-- GD32F1x0_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="ADC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_adc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_adc.c" attr="config" version="3.1.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="CAN" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_can.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="CEC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Consumer Electronics Control (CEC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CEC
        </RTE_Components_h>
        <files>
          <!-- CEC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_cec.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_cec.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="CRC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_crc.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="CMP" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Comparator (CMP) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CMP
        </RTE_Components_h>
        <files>
          <!-- CMP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_cmp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_cmp.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="DAC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_dac.c" attr="config" version="3.1.0" />
        </files>
    </component>

