glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F1x0_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="MCUDBG" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>MCU Debug (MCUDBG) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- MCUDBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_dbg.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="DMA" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_dma.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="EXTI" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_exti.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="FMC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_fmc.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="GPIO" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_gpio.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="SYSCFG" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>System Configuration (SYSCFG) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
        </RTE_Components_h>
        <files>
          <!-- SYSCFG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_syscfg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_syscfg.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="I2C" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_i2c.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="FWDGT" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Free Watchdog Timer (FWDGT) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_fwdgt.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="PMU" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_pmu.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="RCU" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_rcu.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="RTC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_rtc.c" attr="config" version="3.1.0" />
        </files>
    </component>

