glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F1x0_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="SPI_I2S" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_spi.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="TIMER" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_timer.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="USART" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_usart.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="WWDGT" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_wwdgt.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="MISC" Cversion="3.1.0" condition="GD32F1x0 CMSIS">
      <description>MISC driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_misc.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="TSI" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Touch Sensing Interface (TSI) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TSI
        </RTE_Components_h>
        <files>
          <!-- TSI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_tsi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_tsi.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="SLCD" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Segment LCD Controller (SLCD) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SLCD
        </RTE_Components_h>
        <files>
          <!-- SLCD flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_slcd.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_slcd.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="OPA" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Operational Amplifiers (OPA) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_OPA
        </RTE_Components_h>
        <files>
          <!-- OPAMP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_opa.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_opa.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="IVREF" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Programmable Current and Voltage Reference (IVREF) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_IVREF
        </RTE_Components_h>
        <files>
          <!-- IVREF flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_ivref.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_ivref.c" attr="config" version="3.1.0" />
        </files>
    </component>

    <!-- Utilities GD32F1x0 -->
    <component Cclass="Device" Cgroup="GD32F1x0_EVAL" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f1x0_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f1x0_eval.c" attr="config" version="3.1.0"/>
      </files>
    </component>

    <!-- Config GD32F1x0 -->
    <component Cclass="Device" Cgroup="GD32F1x0_libopt" Cversion="3.1.0" condition="GD32F1x0 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/gd32f1x0_libopt.h"/>
      </files>
    </component>

    <!-- Startup GD32F1x0 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="GD32F1x0 CMSIS">
      <description>System Startup for GigaDevice GD32F1x0 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f1x0.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/startup_gd32f1x0.s" attr="config" version="3.1.0" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f1x0.c"      attr="config" version="3.1.0"/>
      </files>
    </component>

    <!-- GD32150C-START Board Support -->
    <bundle Cbundle="GD32150C-START" Cclass="Board Support" Cversion="3.1.0">
      <description>GigaDevice GD32150C-START Board Support</description>
      <doc></doc>
      <component Cgroup="LED" condition="GD32F1x0 CMSIS">
      <description>LED driver for GigaDevice GD32150C-START Board</description>
        <files>
          <file category="source" name="Boards/GigaDevice/GD32150C-START/Common/LED.c"/>
        </files>
      </component>
