glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F1x0_DFP.pdsc
      <component Cgroup="Buttons" condition="GD32F1x0 CMSIS">
      <description>Button driver for GigaDevice GD32150C-START Board</description>
        <files>
          <file category="source" name="Boards/GigaDevice/GD32150C-START/Common/Buttons.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="GigaDevice" name="GD32150C-START" revision="Rev. A" salesContact="http://www.gigadevice.com/page/id-65.html">
      <description>GigaDevice GD32150C-START Board</description>
      <book category="overview"  name="http://www.gigadevice.com"  title="GD32150C -START Board"/>
      <book category="schematic" name="Boards/GigaDevice/GD32150C-START/Documents/GD32150C-START.pdf" title="GD32150C-START Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="GigaDevice:123" Dname="GD32F150C8"/>
      <compatibleDevice deviceIndex="0" Dvendor="GigaDevice:123" DsubFamily="GD32F150"/>
      <feature type="XTAL"       n="8000000"/>
      <feature type="PWR"        n="2.6" m="3.6"              name="Power Supply"/>
      <feature type="LED"         n="3"                              name="LEDs: Power, 2 x User"/>
      <feature type="Button"     n="2"                              name="Push-buttons: User and Reset"/>
    </board>
  </boards>

  <examples>
    <!-- GD32150C-START Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/GigaDevice/GD32150C-START/Blinky">
      <description>Blinky example</description>
      <board name="GD32150C-START" vendor="GigaDevice"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/GigaDevice/GD32150C-START/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="GD32150C-START" vendor="GigaDevice"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>
</package>
